In [20]:
import pandas as pd 
import re

# Pandas pratique

## 1. Excercise 1: From the given dataset print the first and last five rows

In [ ]:
# load dataset
dataset = pd.read_csv('Automobile_data.csv')

# first five rows
print(dataset.head()) # first five rows df.head(5)

# last fives rows
print(dataset.tail()) # last five rows df.tail(5)

   index      company   body-style  wheel-base  length engine-type  \
0      0  alfa-romero  convertible        88.6   168.8        dohc
1      1  alfa-romero  convertible        88.6   168.8        dohc
2      2  alfa-romero    hatchback        94.5   171.2        ohcv
3      3         audi        sedan        99.8   176.6         ohc
4      4         audi        sedan        99.4   176.6         ohc

  num-of-cylinders  horsepower  average-mileage    price
0             four         111               21  13495.0
1             four         111               21  16500.0
2              six         154               19  16500.0
3             four         102               24  13950.0
4             five         115               18  17450.0
    index     company body-style  wheel-base  length engine-type  \
56     81  volkswagen      sedan        97.3   171.7         ohc
57     82  volkswagen      sedan        97.3   171.7         ohc
58     86  volkswagen      sedan        97.3   171.7         ohc
59     87       volvo      sedan       104.3   188.8         ohc
60     88       volvo      wagon       104.3   188.8         ohc

   num-of-cylinders  horsepower  average-mileage    price
56             four          85               27   7975.0
57             four          52               37   7995.0
58             four         100               26   9995.0
59             four         114               23  12940.0
60             four         114               23  13415.0

# Exercise 2: Clean the dataset and update the CSV file

In [ ]:
#na_values consider if the inputs for the selected rows are '?' or 'n.a.', they will be considered as 
#na values in python and will be printed as NaN
dataset = pd.read_csv('Automobile_data.csv', na_values=['?', 'n.a.'])
# dataset = pd.read_csv('Automobile_data.csv', na_values={
#     'price': ['?', 'n.a.'],
#     'stroke': ['?', 'n.a.'],
#     'bore': ['?', 'n.a.']
# })
dataset.to_csv('Automobile_with_NAN_data.csv', index=False)
print(dataset.isnull().sum()) # check how many NaN values in each column

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

## 3. Exercise 3: Find the most expensive car company name

## SERIES COMMANDS          DESCRIPTION
### Series.sum             Return the sum
### Series.min             Return the minimum
### Series.max             Return the maximum     
### Series.idxmin          Return the index of the minimum
### Series.idxmax          Return the index of the maximum
### DataFrame.sum          Return the sum over the requested axis
### DataFrame.min          Return the minimum over the requested axis
### DataFrame.max          Return the maximum over the requested axis
### DataFrame.idxmin       Return the index of the minimum over the requested axis.
### DataFrame.idxmax       Return the index of the maximum over the requested axis.

In [17]:
# most expensive car company name 
# Methode 1
max_price = dataset['price'].max()
most_expensive_car = dataset[dataset['price'] == max_price]
company_name = most_expensive_car['company'].values[0]
print(f"The most expensive car company is: {company_name} with a price of {max_price}")

# Methode 2
most_expensive_car = dataset.loc[dataset['price'].idxmax()]
print(f"The most expensive car company is: {most_expensive_car['company']} with a price of {most_expensive_car['price']}")

# Methode 3
most_expensive_car = dataset.sort_values(by='price', ascending=False).iloc[0]
company_name = most_expensive_car['company']
max_price = most_expensive_car['price']
print(f"The most expensive car company is: {company_name} with a price of {max_price}")

The most expensive car company is: mercedes-benz with a price of 45400.0
The most expensive car company is: mercedes-benz with a price of 45400.0
The most expensive car company is: mercedes-benz with a price of 45400.0

# 4. Exercise 4: Print All Toyota Cars details

In [22]:
# print all toyota cars details

# Methode 1
toyata_cars = dataset.loc[dataset['company'].str.contains('toyota', flags=re.I, regex=True)] 
print(toyata_cars)

# Methode 2
toyata_cars = dataset.groupby('company').get_group('toyota')
print(toyata_cars)

    index company body-style  wheel-base  length engine-type num-of-cylinders  \
48     66  toyota  hatchback        95.7   158.7         ohc             four
49     67  toyota  hatchback        95.7   158.7         ohc             four
50     68  toyota  hatchback        95.7   158.7         ohc             four
51     69  toyota      wagon        95.7   169.7         ohc             four
52     70  toyota      wagon        95.7   169.7         ohc             four
53     71  toyota      wagon        95.7   169.7         ohc             four
54     79  toyota      wagon       104.5   187.8        dohc              six

    horsepower  average-mileage    price
48          62               35   5348.0
49          62               31   6338.0
50          62               31   6488.0
51          62               31   6918.0
52          62               27   7898.0
53          62               27   8778.0
54         156               19  15750.0
    index company body-style  wheel-base  length engine-type num-of-cylinders  \
48     66  toyota  hatchback        95.7   158.7         ohc             four
49     67  toyota  hatchback        95.7   158.7         ohc             four
50     68  toyota  hatchback        95.7   158.7         ohc             four
51     69  toyota      wagon        95.7   169.7         ohc             four
52     70  toyota      wagon        95.7   169.7         ohc             four
53     71  toyota      wagon        95.7   169.7         ohc             four
54     79  toyota      wagon       104.5   187.8        dohc              six

    horsepower  average-mileage    price
48          62               35   5348.0
49          62               31   6338.0
50          62               31   6488.0
51          62               31   6918.0
52          62               27   7898.0
53          62               27   8778.0
54         156               19  15750.0

# 5. Exercise 5: Count total cars per company

In [27]:
# Method 1
total_cars_per_company = dataset.groupby('company').size() # size counts the number of rows per group
print(total_cars_per_company)

company
alfa-romero      3
audi             4
bmw              6
chevrolet        3
dodge            2
honda            3
isuzu            3
jaguar           3
mazda            5
mercedes-benz    4
mitsubishi       4
nissan           5
porsche          3
toyota           7
volkswagen       4
volvo            2
dtype: int64

In [ ]:
# Method 2
# value_counts counts the number of occurrences of each unique value in a column
print(dataset['company'].value_counts())

company
toyota           7
bmw              6
mazda            5
nissan           5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
chevrolet        3
honda            3
isuzu            3
jaguar           3
porsche          3
dodge            2
volvo            2
Name: count, dtype: int64

In [31]:
#  Method 3 use count but i don't recomend it
total_cars_per_company = dataset.groupby('company').count()['price'] # size counts the number of rows per group
print(total_cars_per_company)

company
alfa-romero      3
audi             4
bmw              6
chevrolet        3
dodge            2
honda            3
isuzu            1
jaguar           3
mazda            5
mercedes-benz    4
mitsubishi       4
nissan           5
porsche          2
toyota           7
volkswagen       4
volvo            2
Name: price, dtype: int64

# 6. Exercise 6: Find each company’s highest price car

In [36]:
companies_highest_price_car = dataset.groupby(['company',])['price'].max()
# or
# companies_highest_price_car = dataset.groupby(['company',]).max()['price']
companies_highest_price_car

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

# 7. Exercise 7: Find the average mileage of each car making company

In [39]:
print(dataset.head(2))
avr = dataset.groupby(['company']).mean(numeric_only=True)['average-mileage']
avr

   index      company   body-style  wheel-base  length engine-type  \
0      0  alfa-romero  convertible        88.6   168.8        dohc
1      1  alfa-romero  convertible        88.6   168.8        dohc

  num-of-cylinders  horsepower  average-mileage    price
0             four         111               21  13495.0
1             four         111               21  16500.0

company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        41.000000
dodge            31.000000
honda            26.333333
isuzu            33.333333
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64

# 8. Exercise 8: Sort all cars by Price column

In [41]:
sorted = dataset.sort_values(by='price', ascending=False) # descending
sorted

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
34,46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
46,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
...,...,...,...,...,...,...,...,...,...,...
27,36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN

# 9. Exercise 9: Concatenate two data frames using the following conditions (see below)

In [47]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}

# create two dataframe named df1 and df2
df1 = pd.DataFrame.from_dict(GermanCars)
df2 = pd.DataFrame.from_dict(japaneseCars)

# concatenate the two dataframe
dfx1 = pd.concat([df1,df2], keys=['German','Japanese'], axis=0)
print(dfx1)
print('-------------')

dfx2 = pd.concat([df1,df2], keys=['German','Japanese'], axis=1)
print(dfx2)
print('-------------')

dfx3 = pd.concat([df1,df2])
print(dfx3)

                Company   Price
German   0         Ford   23845
         1     Mercedes  171995
         2          BMV  135925
         3         Audi   71400
Japanese 0       Toyota   29995
         1        Honda   23600
         2       Nissan   61500
         3  Mitsubishi    58900
-------------
     German             Japanese
    Company   Price      Company  Price
0      Ford   23845       Toyota  29995
1  Mercedes  171995        Honda  23600
2       BMV  135925       Nissan  61500
3      Audi   71400  Mitsubishi   58900
-------------
       Company   Price
0         Ford   23845
1     Mercedes  171995
2          BMV  135925
3         Audi   71400
0       Toyota   29995
1        Honda   23600
2       Nissan   61500
3  Mitsubishi    58900

# 10. Exercise 10: Merge two data frames using the following condition (see below)

Create two data frames using the following two Dicts,

Merge two data frames, and append the second data frame as a new column to the first data frame.

In [50]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

df1 = pd.DataFrame.from_dict(Car_Price)
df2 = pd.DataFrame.from_dict(car_Horsepower)

# method 1
df1['Horsepower'] = df2['horsepower']
print(df1)
print('-------')

# method 2
df1.merge(df2, on='Company')

  Company   Price  Horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160
-------

  Company   Price  Horsepower  horsepower
0  Toyota   23845         141         141
1   Honda   17995          80          80
2     BMV  135925         182         182
3    Audi   71400         160         160